In [1]:
def myfunc(n):
  return lambda a: a * n

In [2]:
mytripler = myfunc(3)

In [3]:
mytripler(7)

21

In [4]:
myDoubler = myfunc(2)

In [5]:
myDoubler(7)

14

In [6]:
list_1 = [1,2,3,4,5,6,7,8,9]

In [7]:
list(filter(lambda x: x%2==0, list_1))

[2, 4, 6, 8]

In [8]:
cubed = map(lambda x: pow(x,3), list_1)

In [9]:
list(cubed)

[1, 8, 27, 64, 125, 216, 343, 512, 729]

## Creiamo un Dataframe

In [13]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Luke','Gina','Sam','Emma'],
    'Status': ['Father', 'Mother', 'Son', 'Daughter'],
    'Birthyear': [1976, 1984, 2013, 2016],
})

In [14]:
df

   Name    Status  Birthyear
0  Luke    Father       1976
1  Gina    Mother       1984
2   Sam       Son       2013
3  Emma  Daughter       2016

### Pandas Apply()

In [15]:
df['age'] = df['Birthyear'].apply(lambda x: 2021-x)

In [16]:
df

   Name    Status  Birthyear  age
0  Luke    Father       1976   45
1  Gina    Mother       1984   37
2   Sam       Son       2013    8
3  Emma  Daughter       2016    5

### Funzione filter()

In [17]:
list(filter(lambda x: x>18, df['age']))

[45, 37]

### Funzione map()

La funzione **map()** è una funzione Python che trasforma tutti gli elementi di un elemento iterabile ***senza*** il ricorso esplicito a un ciclo for

In [18]:
df['double_age'] =  df['age'].map(lambda x: x*2)

In [19]:
df

   Name    Status  Birthyear  age  double_age
0  Luke    Father       1976   45          90
1  Gina    Mother       1984   37          74
2   Sam       Son       2013    8          16
3  Emma  Daughter       2016    5          10

### Operatori condizionali

In [20]:
df['Gender'] = df['Status'].map(lambda x: 'Male' if x=='Father' or x=='Son' else 'Female')

In [21]:
df

   Name    Status  Birthyear  age  double_age  Gender
0  Luke    Father       1976   45          90    Male
1  Gina    Mother       1984   37          74  Female
2   Sam       Son       2013    8          16    Male
3  Emma  Daughter       2016    5          10  Female